chore(release): prepare uvtt-v2 specification and upgrader for v2.0.0 final release
